# a = {key1:value1, key2:value2 }
tests_dick = {

    'GLU': ['Глюкоза', 'мМоль/л', '4,10-6,10'],
    'PROT': ['Белок общий', 'г/л', '65,0 – 85,0'],
    'ALB': ['Альбумин', 'г/л', '35,0 – 50,0'],
    'BILD': ['Билирубин  прямой', 'мкМоль/л', '0,00 - 5,10'],
    'BILT': ['Билирубин  общий', 'мкМоль/л', '0,0 - 20,5'],
    'AST': ['Аспартатаминотрансфераза(АсАт)', 'Е/л', 'Ж≤31  М≤38'],
    'ALT': ['Аланинаминотрансфераза(АлАт)', 'Е/л', 'Ж≤31  М≤40'],
    'UREA': ['Мочевина', 'мМоль/л', '2,50 – 8,32'],
    'CREA': ['Креатинин', 'мкМоль/л', 'Ж 53-106 М 71-115'],
    'CHOL': ['Холестерин общий', 'мМоль/л', '≤ 5,20'],
    'ALP': ['Щелочная фосфатаза', 'мЕ/л', '70 – 270'],
    'GGT': ['Гамма-глутамилтранспептидаза(γ-ГТ)', 'мЕ/л', 'Ж≤32  М≤50'],
    'CRP': ['С-реактивный белок(СРБ)', 'мг/л', '≤ 5,0'],
    'CRP1': ['С-реактивный белок(СРБ)', 'мг/л', '≤ 5,0'],
    'IRON': ['Железо сывороточное', 'мкМоль/л', '8,9 - 31,2'],
    'UA': ['Мочевая кислота', 'мкМоль/л', 'Ж140-310 М200-420'],
    'GLU2': ['Глюкоза', 'мМоль/л', '4,10-6,10'],
    'HbA1': ['Гликозилированный гемоглобин(HbА1c)', '%', ' ≤ 6,5'],
    'TG': ['Триглицериды', 'мМоль/л', '≤ 1,71'],
    'HDL': ['ХС - ЛПВП', 'мМоль/л', 'Ж1,0-2,1 М0,9-1,8'],
    'LDL': ['ХС-ЛПНП', 'мМоль/л', '≤ 3,37'],
    'RF': ['Ревматоидный фактор(РФ)', 'мЕ/л', ' ≤ 30'],
    'AMY': [' Амилаза', 'Е/л', '≤ 100'],
    'K': ['Калий', 'мМоль/л', '3,6 – 5,5'],
    'MG': ['Магний', 'мМоль/л', '0,66 – 1,07'],
    'CLOR': [' Хлориды', 'мМоль/л', '96 - 108'],
    'CALC': [' Кальций общий', 'мМоль/л', '2,02 – 2,60'],
    'PHOS': [' Фосфор', 'мМоль/л', '0,7 – 1,6'],
    'AMYP': [' Амилаза панкреатическая', 'Е/л', ' '],
    'CK': ['Креатинфосфокиназа', 'Е/л', ' '],
    'LDH': ['Лактатдегидрогеназа (ЛДГ)', 'Е/л', '195-450']
    
}

table_symbol = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I']
'''
    AbbreviatedName
    ALB
    ALP
    BILD
    LDH
    AMY
    BILT
    UA
    ALT
    AST
    AMYP
    UREA
    PHOS
    IRON
    GLU2
    GLU
    CLOR
    CK
    CHOL
    MG
    GGT
    CALC
    TG
    CPAP
    CKMB
    PROT
    CREA
    LAC
    K
    ASO
    CRP
    RF
    HDL
    LDL
    MAL
    TAS
    ZN
    HbA1
    CRP1



'''
